# Варіант 12
# 
#   На шаховій дошці стоїть тура. 
#   Відзначте положення тури на дошці і всі клітинки,
#   які б’є тура. Клітинку, де стоїть тура,
#   відзначте буквою R, клітинки, які б’є тура,
#   відзначте символами *, решта клітинок заповніть крапками.
#   Програма отримує на вхід координати тури на шаховій
#   дошці в шаховій нотації, тобто, у вигляді e2,
#   де спочатку записується номер стовпця
#   (буква від a до h, зліва направо), потім номер рядка
#   (цифра від 1 до 8, знизу догори). Виведіть на екран
#   зображення шахової дошки як у вихідних даних
# 
#   Вхідні дані:
#   h5
#   Вихідні дані:
#   . . . . . . . *
#   . . . . . . . *
#   . . . . . . . *
#   * * * * * * * R
#   . . . . . . . *
#   . . . . . . . *
#   . . . . . . . *
#   . . . . . . . *
# 
# Дзюба Владислав

n = input("Enter Row and Column: ")

# метч рядка та колонки
col = int(n[1]) - 1
match n[0]:
    case 'a':
        row = 0
    case 'b':
        row = 1
    case 'c':
        row = 2
    case 'd':
        row = 3
    case 'e':
        row = 4
    case 'f':
        row = 5
    case 'g':
        row = 6
    case 'h':
        row = 7

# створення дошки
board = []
for i in range(8):
    n_row = []
    for j in range (8):
        n_row.append('.')
    board.append(n_row)

board[row][col] = "R"

# малюємо зірочки куди може піти тура
for i in range(8):
    for j in range(8):
        if not (i == row and j == col) and (i == row or j == col):
            board[i][j] = '*'

# виводе дошку разом із положеням фігури
for i in range(7, -1, -1):
    for j in range(8):
        print(board[i][j], end=' ')
    print()